app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    respond_with Comment.all

INSERT INTO "comments" ("author", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "Commentor"], ["comment", "Comment"], ["created_at", "2015-09-16 17:50:15.740151"], ["updated_at", "2015-09-16 17:50:15.740151"]]
---
  def create
    respond_with Comment.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @comment = Comment.find(comment_params)